read_verilog -sv ./comparator.sv
copy comparator comparator_synth

hierarchy -top comparator_synth

synth
    abc -g AND, OR, XOR
    opt_clean

write_verilog -noattr ./SYNTH/comparator_synth.sv
stat -tech cmos