# Wczytanie pliku modelu
read_verilog -sv exe_unit_w22.sv

# Utworzenie kopi modulu z inna nazwa
copy ALU ALU_rtl

# Ustawienie hierarchii projektu na nowy modul
hierarchy -top ALU_rtl

# Synteza logiczna
synth

# Mapowanie na bramki
abc -g AND,OR,XOR

# Optymalizacja po mapowaniu
opt_clean

# Zapis wyniku symulacji
write_verilog -noattr exe_unit_w22_rtl.sv

# Wypisanie statystyki uzytych bramek
stat -tech cmos