# Wczytanie pliku modelu
read_verilog -sv comparison.sv

# Utworzenie kopi modulu z inna nazwa
copy comparison comparison_rtl

# Ustawienie hierarchii projektu na nowy modul
hierarchy -top comparison_rtl

# Synteza logiczna
synth

# Mapowanie na bramki
abc -g AND,OR,XOR

# Optymalizacja po mapowaniu
opt_clean

# Zapis wyniku symulacji
write_verilog -noattr comparison_rtl.sv

# Wypisanie statystyki uzytych bramek
stat -tech cmos