# Wczytanie pliku modelu
read_verilog -sv negation.sv

# Utworzenie kopi modulu z inna nazwa
copy negation negation_rtl

# Ustawienie hierarchii projektu na nowy modul
hierarchy -top negation_rtl

# Synteza logiczna
synth

# Mapowanie na bramki
abc -g AND,OR,XOR

# Optymalizacja po mapowaniu
opt_clean

# Zapis wyniku symulacji
write_verilog -noattr negation_rtl.sv

# Wypisanie statystyki uzytych bramek
stat -tech cmos