# Wczytanie pliku modelu
read_verilog -sv changecode.sv

# Utworzenie kopi modulu z inna nazwa
copy changecode changecode_rtl

# Ustawienie hierarchii projektu na nowy modul
hierarchy -top changecode_rtl

# Synteza logiczna
synth

# Mapowanie na bramki
abc -g AND,OR,XOR

# Optymalizacja po mapowaniu
opt_clean

# Zapis wyniku symulacji
write_verilog -noattr changecode_rtl.sv

# Wypisanie statystyki uzytych bramek
stat -tech cmos