read_verilog -sv ./u2_to_sm.sv
copy u2_to_sm u2_to_sm_synth

hierarchy -top u2_to_sm_synth

synth
    abc -g AND, OR, XOR
    opt_clean

write_verilog -noattr ./SYNTH/u2_to_sm_synth.sv
stat -tech cmos