read_verilog -sv ./bit_shift.sv
copy bit_shift bit_shift_synth

hierarchy -top bit_shift_synth

synth
    abc -g AND, OR, XOR
    opt_clean

write_verilog -noattr ./SYNTH/bit_shift_synth.sv
stat -tech cmos